FuzePOSoapApp/src/main/resources/createpo-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:us="http://www.createpocartproducer.com/createpo">			
	<soapenv:Body>
		<us:AddPODetailsRequest>
			<us:poreq>
				<us:id>1</us:id>
                <us:item>
                    <us:id>1</us:id>
                    <us:name>Antenna</us:name>
                    <us:contractId>IEMA-00823-2015</us:contractId>
                    <us:dueDate>2020-02-20+05:30</us:dueDate>
                    <us:shipToId>138863</us:shipToId>
                    <us:activity>ANTENNA</us:activity>
                    <us:model>5T</us:model>
                    <us:description>Testing</us:description>
                    <us:price>4000</us:price>
                    <us:inStock>true</us:inStock>
                </us:item>
                <us:item>
                    <us:id>2</us:id>
                    <us:name>Goods</us:name>
                    <us:contractId>IEMA-00823-2015</us:contractId>
                    <us:dueDate>2020-02-20+05:30</us:dueDate>
                    <us:shipToId>138863</us:shipToId>
                    <us:activity>GOODS</us:activity>
                    <us:model>MS</us:model>
                    <us:description>Sample</us:description>
                    <us:price>5000</us:price>
                    <us:inStock>true</us:inStock>
                </us:item>
            </us:poreq>
		</us:AddPODetailsRequest>
	</soapenv:Body>		
</soapenv:Envelope>